_posts/2018-03-03-Building-IPFS-on-Debian-9.html
---
layout: post
title: Building IPFS on Debian 9 (stretch)
date: 2018-03-03T15:21:44+01:00
categories:
  - software
---

<p>
Recently my teammate told us about IPFS. It caught my attention,
because I read about it before in this <a href="https://blog.mozilla.org/addons/2018/01/26/extensions-firefox-59/">post</a>. It seems like an
interesting idea to crossbreed git and Bittorrent.
</p>

<p>
The project hasn't reached a stable state yet and it seems that none
of the major Linux distributions package it downstream. Building it
isn't too hard, but on my Debian 9 machin isn't trivial either. Debian
stretch provides Go, which is the language of choice of IPFS
developers, but it's only Go 1.7 (1.8 in stretch-backports) and IPFS
requires Go 1.9.
</p>

<p>
So let's go step-by-step .
</p>

<ol class="org-ol">
<li><code>apt-get install golang-go</code>. This installs Go 1.7, which is needed to build Go 1.9.
</li>
<li>Download <a href="https://packages.debian.org/source/buster/golang-1.9">golang-1.9</a> sources for Debian buster.
</li>
<li>Build the packages the ususal way (<code>dpkg-source -x</code> and <code>dpkg-buildpackage</code>).
</li>
<li>Install them.
</li>
</ol>

<p>
Here is where tweaking begins. First you need to set environment
variables to make Go 1.9 the default.
</p>

<div class="org-src-container">

<pre class="src src-sh">mkdir $HOME/.go
export GOPATH=$HOME/.go:/usr/lib/go-1.9/
export PATH=/usr/lib/go-1.9/bin/:$PATH
</pre>
</div>

<p>
At this point you can start following the instructions from the IPFS
README.md file to download and build ipfs on your machine.
</p>

<div class="org-src-container">

<pre class="src src-sh">go get -u -d github.com/ipfs/go-ipfs
cd $HOME/.go/src/github.com/ipfs/go-ipfs
make build
</pre>
</div>

<p>
Several go packages are required to build IPFS and they are downloaded
automatically using <a href="https://github.com/whyrusleeping/gx">gx</a> package manager, which is a very interesting
piece of software itself.
</p>

<p>
When everything is ready <code>make install</code> and you've got <code>ipfs</code> binary
in <code>$HOME/.go/bin</code>. Don't forget to add this directory to your <code>PATH</code>.
</p>

<p>
Now the fun part begins: reading. I will definitely help if you
already know how git works internally, but you need to lear how to do
stuff with <code>ipfs</code> sub-commands. Aside from the official <a href="https://github.com/ipfs/ipfs">IPFS papers</a>
and <a href="https://ipfs.io/docs/">documentation</a> I strongly recommend reading <a href="https://medium.com/@ConsenSys/an-introduction-to-ipfs-9bba4860abd0">An Introduction to
IPFS</a>.
</p>
